{
	"Button": {
		"Save": "зберегти",
		"Cancel": "відмінити",
		"MoreOptions": "більше опцій",
		"SaveAndKeepOpen": "зберегти, але залишити діалог відкритим"
	},
	"Status": {
		"Published": "опубліковано",
		"Unpublished": "неопубліковано / чорнетка"
	},
	"Message": {
		"Saving": "зберігаємо...",
		"Saved": "збережено",
		"ErrorWhileSaving": "В процесі збереження виникла помилка.",
		"WillPublish": "буде опубліковано після збереження",
		"WontPublish": "не буде опубліковано після збереження",
		"PleaseCreateDefLang": "будь-ласка редагуйте це в мові по замовчуванню спочатку.",
		"ExitOk": "Ви справді хочете вийти?",
		"Deleting": "видалення...",
		"Ok": "ok",
		"Error": "помилка",
		"CantSaveProcessing": "неможливо зберегти тому що інший процесс іще виконується",
		"CantSaveInvalid": "форма заповнена некорректно, неможливо зберегти - помилки у: <ul>{0}</ul>",
		"FieldErrorList": "<li>{field} ({error})</li>"
	},
	"Errors": {
		"UnclearError": "Щось пішло не так - можливо частини працюють, можливо ні. Вибачте :(",
		"InnerControlMustOverride": "Внутрішній контрол має перекривати цю функцію.",
		"UnsavedChanges": "У Вас є незбережені зміни.",
		"DefLangNotFound": "Значення для мови по замовчуванню не знайдено, але знайдено кілька інших значень - неможливо редагувати"
	},
	"General": {},
	"EditEntity": {
		"DefaultTitle": "Редагувати елемент",
		"SlotUsedtrue": "цей елемент відкритий для редагування. Натисніть тут для блокування / видаліть його і поверніть до значення по замовчуванню.",
		"SlotUsedfalse": "цей елемент заблокований і залишиться пустим або значенням по замовчуванню. Значення наведені для вашої зручності. Натисніть тут для розблокування, якщо необхідно."
	},
	"FieldType": {
		"Entity": {
			"Choose": "додати існуючий елемент",
			"New": "створити новий",
			"EntityNotFound": "(елемент не знайдено)",
			"DragMove": "перетягніть для того щоб змінити порядок у списку",
			"Edit": "редагувати цей елемент",
			"Remove": "видалити зі списку"
		}
	},
	"LangMenu": {
		"UseDefault": "авто (по замовчуванню)",
		"In": "у {{languages}}",
		"EditableIn": "доступний для редагування у {{languages}}",
		"AlsoUsedIn": ", також використовується у {{more}}",
		"NotImplemented": "Ця дія іще не реалізована.",
		"CopyNotPossible": "Копіювання неможливе: це поле недоступне.",
		"Unlink": "перевести (unlink)",
		"LinkDefault": "пов'язати з значенням по замовчуванню",
		"GoogleTranslate": "машинний переклад (Google)",
		"Copy": "копіювати з",
		"Use": "використовувати з",
		"Share": "поділитись з"
	},
	"LangWrapper": {
		"CreateValueInDefFirst": "Буд ласка введіть значення для '{{fieldname}}' для основної мови, перед тим як перекласти."
	}
}