Repository: 2sic/2sxc
Catalog: Administration/App_LocalResources/EditTemplate.ascx.*.resx
Languages: de_de

# btnUpdate.Text
source: Update
de_de: Speichern

# ddlTemplateLocations.Text
source: Template Location
de_de: Speicherort

# hlkCancel.Text
source: Cancel
de_de: Abbrechen

# lblEditTemplateHeading.Text
source: Edit Template
de_de: Vorlage bearbeiten

# lblHidden.Help
source: Choose if the template is hidden in the template chooser and module settings.
de_de: Geben Sie an, ob die Vorlage in der Vorlagen-Auswahl und in den Moduleinstellungen versteckt sein soll.

# lblHidden.Text
source: Hidden
de_de: Versteckt

# lblTemplateFile.Help
source: Choose the Template File
de_de: Wählen Sie die Vorlagen-Datei

# lblTemplateFile.Text
source: Template File
de_de: Datei wählen

# lblTemplateLocation.Help
source: <ul><li>Portal File System: The template file is located in the current portal folder</li><li>Default File System: The template file is located in the /Portals/_default folder.</li></ul>
de_de: <ul><li>Portal Dateisystem: Die Vorlagendatei befindet sich im Portal-Ordner (z.B. /Portals/[Portal-Ordner]/2sexy).</li><li>Host Dateisystem: Die Vorlage befindet sich im /Portals/_default Ordner.</li></ul>

# lblTemplateLocation.Text
source: Template Location
de_de: Speicherort

# lblTemplateName.Text
source: Template Name
de_de: Name der Vorlage

# lblTemplateType.Help
source: Select the template Type
de_de: Wählen Sie den Vorlagen-Typ aus.

# lblTemplateType.Text
source: Template Type
de_de: Typ

# TemplateLocationHostFileSystem.Text
source: Host File System
de_de: Host Dateisystem

# TemplateLocationPortalFileSystem.Text
source: Portal File System
de_de: Portal Dateisystem

# valContentType.ErrorMessage
source: Please select a content type.
de_de: Wählen Sie einen Inhaltstyp.

# valTemplateFile.ErrorMessage
source: Please select a template file.
de_de: Wählen Sie eine Vorlagen-Datei.

# valTemplateName.ErrorMessage
source: Please enter a template name.
de_de: Geben Sie einen Vorlagen-Namen an.

# btnCreateTemplateFile.Text
source: Create new
de_de: Neu erstellen

# lblTemplateFileName.Text
source: Template File Name
de_de: Dateiname der Vorlage

# NewTemplateFile.DefaultText
source: <p>You successfully created your own template. Start editing it by hovering the "Manage" button and opening the "Edit Template" dialog.</p>
de_de: <p>Ihre Vorlage wurde erstellt. Bearbeiten Sie die Vorlage über den "Verwalten" > "Vorlage bearbeiten" Dialog.</p>

# valTemplateFileName.ErrorMessage
source: Please enter a file name for the new template.
de_de: Bitte geben Sie einen Dateinamen für die neue Vorlage ein.

# hlkTemplateMetaData.Text
source: Edit MetaData
de_de: Metadaten bearbeiten

# lblEnableList.Help
source: Specify whether the template can handle lists or not.
de_de: Wählen Sie, ob die Vorlage Listen unterstützt oder nicht.

# lblEnableList.Text
source: Enable List
de_de: Unterstützt Listen

# lblSeparateContentPresentation.Text
source: Separate Presentation from Content
de_de: Presentation von Content trennen

# lblSeparateContentPresentation.Help
source: Specify if you want to select a separate ContentType for presentation configuration.
de_de: Geben Sie an, ob Sie einen separaten ContentType für Presentation-Konfiguration auswählen wollen.
