{
	"General": {
		"Note2Translator": "це основні ключі для кнопок і короткі повідомлення, що використовуються в різноманітних діалогах",
		"Buttons": {
			"Add": "додати",
			"Cancel": "відмінити",
			"Copy": "скопіювати",
			"Delete": "видалити",
			"Edit": "редагувати",
			"ForceDelete": "force delete",
			"NotSave": "не зберігати",
			"Permissions": "права доступу",
			"Refresh": "поновити",
			"Rename": "перейменувати",
			"Save": "зберегти",
			"System": "додаткові системні функції"
		},
		"Messages": {
			"Loading": "завантаження...",
			"NothingFound": "елементи не знайдено",
			"CantDelete": "неможливо видалити {{target}}"
		},
		"Questions": {
			"Delete": "ви дійсно хочете видалити {{target}}?",
			"DeleteEntity": "видалити '{{title}}' ({{id}})?",
			"Rename": "яку нову назву Ви хочете для {{target}}?",
			"SystemInput": "Це дуже важлива операція. Використовуйте її тільки тоді, коли знаєте що Ви робите. \n\n Ввести команди адміністратора:",
			"ForceDelete": "Ви дійсно хочете force delete '{{title}}' ({{id}})?"
		},
		"Terms": {
			"Title": "заголовок"
		}
	},
	"DataType": {
		"All": {
			"Title": "Основні Налаштування"
		},
		"Boolean": {
			"Short": "так/ні",
			"ShortTech": "Логічне",
			"Choice": "Логічне (так/ні)",
			"Explanation": "Так/ні або істина/неправда значення"
		},
		"DateTime": {
			"Short": "дата/час",
			"ShortTech": "ДатаЧас",
			"Choice": "Дата і/або час",
			"Explanation": "для дати, часу або комбінованих значень"
		},
		"Entity": {
			"Short": "елемент(и)",
			"ShortTech": "Елементи",
			"Choice": "Елементи (інший контент)",
			"Explanation": "один або багато інших елементів контенту"
		},
		"Hyperlink": {
			"Short": "ссилка",
			"ShortTech": "ВебСсилка",
			"Choice": "Ссилка / посилання на файл",
			"Explanation": "Веб-ссилка або посилання на малюнок / файл"
		},
		"Number": {
			"Short": "число",
			"ShortTech": "Число",
			"Choice": "Число",
			"Explanation": "будь-яка кількість чисел"
		},
		"String": {
			"Short": "текст",
			"ShortTech": "Строка символів",
			"Choice": "Текст / строка символів",
			"Explanation": "будь-який тип тексту"
		},
		"Empty": {
			"Short": "пусто",
			"ShortTech": "Пусто",
			"Choice": "Пусто - для заголовків форм та ін.",
			"Explanation": "використовуйте для Ваших форм"
		},
		"Custom": {
			"Short": "Індивідуальні",
			"ShortTech": "Індивідуальні",
			"Choice": "Індивідуальні - ui-утиліти або типи на замовлення",
			"Explanation": "використовувати для таких речей, як GPS-вибору (який пише в декілька полів) або індивідуальну інформацію, яка відображає щось екзотичне в БД, наприклад: масив, користувальницького JSON, тощо "
		}
	},
	"ContentTypes": {
		"Title": "Типи контенту і Дані",
		"TypesTable": {
			"Name": "Назва",
			"Description": "Опис",
			"Fields": "Поля",
			"Items": "Елементи",
			"Actions": ""
		},
		"TitleExportImport": "Експорт / Імпорт",
		"Buttons": {
			"Export": "експорт",
			"Import": "імпорт",
			"ChangeScope": "змінити область",
			"ChangeScopeQuestion": "Це розширений функціонал для відображення контенту з інших областей. Не робіть цього, якщо Ви не знаєте що Ви робите, типи контенту з інших областей зазвичай сховані з позитивних міркувань."
		},
		"Messages": {
			"SharedDefinition": "this content-type shares the definition of #{{SharedDefId}} so you can't edit it here - read 2sxc.org/help?tag=shared-types",
			"TypeOwn": "this is an own content-type, it does not use the definition of another content-type - read 2sxc.org/help?tag=shared-types",
			"TypeShared": "this content-type inherits the definition of #{{SharedDefId}} - read 2sxc.org/help?tag=shared-types"
		}
	},
	"ContentTypeEdit": {
		"Title": "Редагувати Тип Контенту",
		"Name": "Назва",
		"Description": "Опис",
		"Scope": "Область"
	},
	"Fields": {
		"Title": "Поля Типу Контенту",
		"TitleEdit": "Додати Поля",
		"Table": {
			"Title": "Назва",
			"Name": "Статична Назва",
			"DataType": "Тип Даних",
			"Label": "Мітка",
			"InputType": "Тип Вводу",
			"Notes": "Коментарі",
			"Sort": "Сортування",
			"Action": ""
		},
		"General": "Основні"
	},
	"Permissions": {
		"Title": "Права доступу",
		"Table": {
			"Name": "Назва",
			"Id": "ID",
			"Condition": "Умова",
			"Grant": "Grant",
			"Actions": ""
		}
	},
	"Pipeline": {
		"Manage": {
			"Title": "Візуальні запити / Pipelines",
			"Intro": "Використовуйте візуальний дизайнер для створення або поєднання даних з різних джерел даних. Надалі це може використовуватись у views або бути доступним як JSON (якщо права дозволяють). <a href='http://2sxc.org/en/help?tag=visualquerydesigner' target='_blank'>детальніше</a>",
			"Table": {
				"Id": "ID",
				"Name": "Назва",
				"Description": "Опис",
				"Actions": ""
			}
		},
		"Designer": {},
		"Stats": {
			"Title": "Результати Запиту",
			"Intro": "Повний результат записаний до Консолі Браузера. Далі Ви знайдете більше інформації для налагодження.",
			"ParamTitle": "Параметри & Статистика",
			"ExecutedIn": "Виконано за {{ms}}мс ({{ticks}} ticks)",
			"QueryTitle": "Результати запиту",
			"SourcesAndStreamsTitle": "Джерела даних та Потоки",
			"Sources": {
				"Title": "Джерела даних",
				"Guid": "Guid",
				"Type": "Тип",
				"Config": "Конфігурація"
			},
			"Streams": {
				"Title": "Потоки",
				"Source": "Джерела",
				"Target": "Ціль",
				"Items": "Елементи",
				"Error": "Помилка"
			}
		}
	},
	"Content": {
		"Manage": {
			"Title": "Управління Контентом / Даними",
			"Table": {
				"Id": "ID",
				"Status": "Статус",
				"Title": "Заголовок",
				"Actions": ""
			},
			"NoTitle": "- без заголовка -"
		},
		"Publish": {
			"PnV": "опублікований і видимий",
			"DoP": "це чорнетка іншого, вже опублікованого елементу",
			"D": "не опублікований на даний момент",
			"HD": "має чорнетку: {{id}}",
			"HP": "замінить публікацію"
		},
		"Export": {
			"Title": "Експорт Контенту / Даних",
			"Help": "Буде згенеровано XML файл, який Ви зможете редагувати в Excel. Якщо Ви просто хочете імпортувати нові дані, то використовуйте це для того, щоб отримати зразок-схему, що Ви зможете заповнити в Excel. Відвідайте <a href='http://2sxc.org/help' target='_blank'>http://2sxc.org/help</a> для подальших інструкцій.",
			"Commands": {
				"Export": "Експорт"
			},
			"Fields": {
				"Language": {
					"Label": "Мови",
					"Options": {
						"All": "Усі"
					}
				},
				"LanguageReferences": {
					"Label": "Значення посилань до інших мов",
					"Options": {
						"Link": "Залишити посилання на інші мови (для ре-імпорту)",
						"Resolve": "Замінити посилання реальними значеннями"
					}
				},
				"ResourcesReferences": {
					"Label": "Посилання на файл / сторінку",
					"Options": {
						"Link": "Залишити посилання (для ре-імпорту, наприклад Page:4711)",
						"Resolve": "Замінити посилання з реальними значеннями URLs (наприклад /Portals/0...)"
					}
				},
				"RecordExport": {
					"Label": "Експорт даних",
					"Options": {
						"Blank": "Ні, тільки експорт пустого бланку - схеми данних (для імпорту нових даних)",
						"All": "Так, експортувати усі елементи контенту"
					}
				}
			}
		},
		"Import": {
			"Title": "Іморт Контенту / Даних, Крок ",
			"TitleSteps": "{{step}} із 3",
			"Help": "Буде виконано імпорт елементів контенту в 2sxc. Це потребує щоб типи контенту були визначені перед тим, як Ви будете виконувати імпорт, і також що Ви створили файл для імпорту на основі шаблоу з Експорту. Відвідайте <a href='http://2sxc.org/help' target='_blank'>http://2sxc.org/help</a> для подальших інструкцій.",
			"Fields": {
				"File": {
					"Label": "Виберіть файл"
				},
				"ResourcesReferences": {
					"Label": "Посилання на сторінку / файл",
					"Options": {
						"Keep": "Імпортувати посилання так, як записано у файлі (наприклад /Portals/...)",
						"Resolve": "Спробувати розібрати шляхи до посилань"
					}
				},
				"ClearEntities": {
					"Label": "Очистити усі інші елементи",
					"Options": {
						"None": "Залишити усі елементи, що не були знайдені під час імпорту",
						"All": "Видалити усі елементи, що не були знайдені під час імпорту"
					}
				}
			},
			"Commands": {
				"Preview": "Попередній перегляд імопрту",
				"Import": "Імпорт"
			},
			"Messages": {
				"BackupContentBefore": "Обов'єязково зробіть резервну копію порталу!",
				"WaitingForResponse": "Будь-ласка зачекайте, йде обробка...",
				"ImportSucceeded": "Іморт виконано.",
				"ImportFailed": "Помилка під час імпорту.",
				"ImportCanTakeSomeTime": "Примітка: Імпорт перевіряє багато даних і це може зайняти дейкий час."
			},
			"Evaluation": {
				"Error": {
					"Title": "Спроба імпортувати файл '{{filename}}'",
					"Codes": {
						"0": "Виникла невідома помилка.",
						"1": "Обраний тип контенту не існує.",
						"2": "Документ має неправильний формат XML файлу.",
						"3": "Обраний тип контенту не відповідає типу контенту, що вказаний в XML файлі.",
						"4": "Ця мова не підтримується.",
						"5": "Документ не визначає усі мови для усіх елементів.",
						"6": "Посилання на мову не може бути визначено, ця мова не підтримується.",
						"7": "Посилання на мову не може бути визначено, захист читання-запису не підтримується.",
						"8": "Значення не може бути прочитано, тому що має невірний формат."
					},
					"Detail": "Деталі: {{detail}}",
					"LineNumber": "Номер рядка: {{number}}",
					"LineDetail": "Деталі рядка: {{detail}}"
				},
				"Detail": {
					"Title": "Спроба імпортувати файл '{{filename}}'",
					"File": {
						"Title": "Файл містить:",
						"ElementCount": "{{count}} елементів контенту (records/entities)",
						"LanguageCount": "{{count}} мов",
						"Attributes": "{{count}} колонок: {{attributes}}"
					},
					"Entities": {
						"Title": "Якщо Ви натиснете Імпорт, це:",
						"Create": "Створить {{count}} елементів контенту",
						"Update": "Поновить {{count}} елементів контенту",
						"Delete": "Видалить {{count}} елементів контенту",
						"AttributesIgnored": "Ігнорувати {{count}} колонки: {{attributes}}"
					}
				}
			}
		},
		"History": {
			"Title": "Історія {{id}}",
			"Table": {
				"Id": "#",
				"When": "Коли",
				"User": "Користувач",
				"Actions": ""
			}
		}
	},
	"AdvancedMode": {
		"Info": {
			"Available": "цей діалог має розширені / режиму відладки для power-users - читайте більше на 2sxc.org/help?tag=debug-mode",
			"TurnOn": "розширений / режим відладки on",
			"TurnOff": "розширений / режим відладки off"
		}
	}
}