{
  "Button": {
    "Save": "зберегти",
    "Cancel": "відмінити",
    "MoreOptions": "більше опцій",
    "SaveAndKeepOpen": "зберегти та залишити діалог відкритим"

  },
  "Status": {
    "Published": "опубліковано",
    "Unpublished": "неопубліковано / чорнетка"
  },
  "Message": {
    "Saving": "збереження...",
    "Saved": "збережено",
    "ErrorWhileSaving":  "Помилка під час збереження.",
    "WillPublish": "буде опубліковано під час збереження",
    "WontPublish": "не буде опубліковано під час збереження",
    "PleaseCreateDefLang": "Будь-ласка редагуйте спочатку основну мову.",
    "ExitOk": "Ви справді хочете вийти?"
  },
  "Errors": {
    "UnclearError": "Щось пішло не так - можливо частини працюють, можливо ні. Вибачте :(",
    "InnerControlMustOverride": "Внутрішній елемент має перекрити цю функцію.",
    "UnsavedChanges": "У Вас є незбережені дані.",
    "DefLangNotFound": "Значення для мови по замовчуванню не знайдено, але знайдено декілька значень - які не можемо опрацювати"
  },
  "General": {
  },
  "EditEntity": {
    "DefaultTitle": "Редагувати елемент",
    "SlotUsedtrue": "Цей елемент відкритий для редагування. Натисніть тут для блокування / зняття його та повернення до значення по замовчуванню.",
    "SlotUsedfalse": "цей елемент заблокованно і буде залишатись пустим. Значення показано для Вашої зручності. Натисніть тут для того, щоб розблокувати (якщо необхідно)."
  },
  "FieldType": {
    "Entity": {
      "Choose": "-- вибрати елемент для додавання --",
      "New": "-- створити новий --",
      "EntityNotFound": "(елемент не знайдено)",
      "DragMove": "потягніть щоб змінити порядок у списку",
      "Edit": "редагувати цей елемент",
      "Remove": "видалити зі списку"
    }
  },
  "LangMenu": {
    "UseDefault": "auto (по замовчуванню)",
    "In": "у {{languages}}",
    "EditableIn": "відредаговано у {{languages}}",
    "AlsoUsedIn": ", також використовувався у {{more}}",
    "NotImplemented": "Ця дія іще не впроваджена.",
    "CopyNotPossible": "Копіювання неможливе: поле заблоковано.",

    "Unlink": "перекласти (unlink)",
    "LinkDefault": "link по замовчуванню",
    "GoogleTranslate": "машинний переклад (Google)",
    "Copy": "копіювати із",
    "Use": "використовувати із",
    "Share": "розшарити із"
  },
  "LangWrapper": {
    "CreateValueInDefFirst": "Будь-ласка створіть значення для '{{fieldname}}' у основній мові перед перекладом."

  },
  "Dialog1": {
  },
  "dialog2": {
  }
}